{
  "docs": {
    "whatIsFormshive": {
      "title": "Formshive คืออะไร?",
      "subtitle": "เรียนรู้พื้นฐานของ Formshive",
      "description": "Formshive เป็นเครื่องมือง่าย ๆ ที่ช่วยให้คุณสร้างฟอร์มเว็บและรวบรวมข้อมูลจากผู้เยี่ยมชมเว็บไซต์ของคุณ คิดว่ามันเป็นเหมือนกล่องจดหมายดิจิทัล - ผู้คนกรอกฟอร์มของคุณ และคุณจะได้รับข้อความจากพวกเขา",
      "keyBenefits": {
        "title": "ประโยชน์หลัก",
        "noCoding": "ไม่ต้องเขียนโค้ดสำหรับฟอร์มพื้นฐาน",
        "multipleWays": "มีหลายวิธีในการผสานรวมกับเว็บไซต์ของคุณ",
        "spamProtection": "ป้องกันสแปมอัตโนมัติ",
        "emailNotifications": "แจ้งเตือนทางอีเมลเมื่อมีคนส่งฟอร์ม"
      }
    },
    "formsWithWithoutFields": {
      "title": "ฟอร์มที่มีและไม่มีฟิลด์",
      "subtitle": "ทำความเข้าใจว่า Formshive จัดการฟอร์มประเภทต่าง ๆ อย่างไร",
      "withFields": {
        "title": "ฟอร์มที่มีฟิลด์ (แบบมีโครงสร้าง)",
        "description": "เมื่อคุณกำหนดฟิลด์เฉพาะ (เช่น \"ชื่อ\", \"อีเมล\", \"ข้อความ\"), Formshive จะรู้ว่าต้องคาดหวังอะไร สิ่งนี้ทำให้คุณได้คุณสมบัติเพิ่มเติม เช่น การตรวจสอบความถูกต้อง ฟิลด์บังคับ และรูปแบบฟอร์มที่สวยงาม",
        "benefits": {
          "title": "✅ ประโยชน์:",
          "professionalLooking": "ฟอร์มที่ดูเป็นมืออาชีพ",
          "emailValidation": "การตรวจสอบอีเมล",
          "requiredFields": "การตรวจสอบฟิลด์บังคับ",
          "dropdowns": "เมนูดรอปดาวน์และกล่องกาเครื่องหมาย",
          "spamProtection": "การป้องกันสแปมที่ดีกว่า"
        }
      },
      "withoutFields": {
        "title": "ฟอร์มที่ไม่มีฟิลด์ (แบบยืดหยุ่น)",
        "description": "คุณยังสามารถสร้างฟอร์มที่รับเนื้อหาใดก็ได้ - ไม่ว่าใครจะส่งอะไรมา คุณก็จะได้รับ นี่เหมาะสำหรับฟอร์มติดต่อง่าย ๆ หรือเมื่อคุณต้องการความยืดหยุ่นสูงสุด",
        "bestFor": {
          "title": "⚡ เหมาะที่สุดสำหรับ:",
          "quickContact": "ฟอร์มติดต่อแบบเร็ว",
          "existingHtml": "ฟอร์ม HTML ที่มีอยู่แล้ว",
          "maxFlexibility": "เมื่อคุณต้องการความยืดหยุ่นสูงสุด",
          "feedback": "การรวบรวมความคิดเห็นง่าย ๆ"
        }
      }
    },
    "formSubmission": {
      "title": "การส่งฟอร์ม",
      "subtitle": "การส่งฟอร์มทำงานอย่างไร และเกิดอะไรขึ้นหลังจากผู้ใช้ส่งฟอร์ม",
      "description": "เมื่อมีคนส่งฟอร์มของคุณ, Formshive จะประมวลผลข้อมูลผ่านขั้นตอนการตรวจสอบหลายขั้นตอน และจากนั้นตอบสนองตามการกำหนดค่าฟอร์มของคุณและประเภทของคำขอ",
      "validation": {
        "title": "กระบวนการตรวจสอบ",
        "description": "การส่งฟอร์มทุกครั้งจะผ่านการตรวจสอบอย่างครอบคลุมเพื่อให้แน่ใจว่าข้อมูลมีคุณภาพและปลอดภัย หากการตรวจสอบล้มเหลว ผู้ใช้จะได้รับข้อความแสดงข้อผิดพลาดที่ละเอียด",
        "steps": {
          "title": "ขั้นตอนการตรวจสอบ:",
          "formExists": "1. **ฟอร์มมีอยู่:** ตรวจสอบว่า Form ID ถูกต้อง",
          "captcha": "2. **ตรวจสอบ CAPTCHA:** ตรวจสอบความท้าทายป้องกันสแปม (หากเปิดใช้งาน)",
          "fieldValidation": "3. **ตรวจสอบฟิลด์:** ตรวจสอบฟิลด์บังคับ รูปแบบอีเมล ฯลฯ (หากเปิดใช้งาน)",
          "spamDetection": "4. **ตรวจจับสแปม:** วิเคราะห์เนื้อหาเพื่อหารูปแบบสแปม (หากเปิดใช้งาน)"
        }
      },
      "errorHandling": {
        "title": "การจัดการข้อผิดพลาดที่เป็นมิตรกับผู้ใช้",
        "description": "เมื่อมีคนทำผิดพลาดในการกรอกฟอร์มของคุณ, Formshive จะให้ข้อความแสดงข้อผิดพลาดที่ช่วยเหลือและชัดเจน แทนที่จะสูญเสียงานของพวกเขา ผู้ใช้จะเห็นว่าต้องแก้ไขอะไรบ้าง โดยข้อมูลเดิมของพวกเขาจะถูกเก็บไว้",
        "htmlForms": {
          "title": "ฟอร์ม HTML (ผู้เยี่ยมชมเว็บไซต์):",
          "seeErrorPage": "เห็นหน้าข้อผิดพลาดที่เป็นมิตรพร้อมฟอร์ม",
          "inputPreserved": "ข้อมูลของพวกเขาถูกเก็บไว้ - ไม่ต้องพิมพ์ใหม่!",
          "fieldErrors": "ข้อผิดพลาดของฟิลด์เฉพาะถูกเน้นด้วยสีแดง",
          "clearExplanation": "คำอธิบายที่ชัดเจนว่าเกิดอะไรขึ้น"
        },
        "apiRequests": {
          "title": "คำขอ API/JSON (นักพัฒนา):",
          "detailedError": "ข้อมูลข้อผิดพลาดที่ละเอียดในรูปแบบ JSON",
          "fieldSpecific": "รหัสข้อผิดพลาดและข้อความเฉพาะฟิลด์",
          "machineReadable": "อ่านได้ด้วยเครื่องสำหรับการจัดการข้อผิดพลาดแบบกำหนดเอง",
          "perfectForDynamic": "เหมาะสำหรับฟอร์มไดนามิกและแอป"
        }
      },
      "afterSubmission": {
        "title": "เกิดอะไรขึ้นหลังจากมีคนส่งฟอร์มของคุณ",
        "description": "เมื่อมีคนส่งฟอร์มของคุณสำเร็จ, Formshive จะตัดสินใจว่าจะแสดงอะไรให้พวกเขาต่อไป นี่ขึ้นอยู่กับว่าฟอร์มของคุณถูกตั้งค่าอย่างไร และใช้งานบนเว็บไซต์ของคุณอย่างไร",
        "diagramNote": "หากคุณต้องการดูแผนภาพ: ",
        "diagramLink": "Form Submission Flow (mermaid.live/edit)",
        "customThankYou": {
          "title": "หน้าขอบคุณแบบกำหนดเอง:",
          "description": "หากคุณตั้งค่า \"Redirect URL\" ในการตั้งค่าฟอร์ม ผู้เยี่ยมชมจะไปยังหน้าขอบคุณแบบกำหนดเองของคุณโดยตรง เหมาะสำหรับข้อเสนอพิเศษหรือขั้นตอนถัดไปที่ละเอียด"
        },
        "builtInSuccess": {
          "title": "หน้าสำเร็จในตัว:",
          "description": "หากไม่ได้ตั้งค่า redirect URL ผู้เยี่ยมชมจะเห็นหน้า \"ขอบคุณ ข้อความของคุณได้รับแล้ว\" แบบง่าย ๆ สะอาดและเป็นมืออาชีพ ใช้งานได้ดีกับฟอร์มส่วนใหญ่"
        },
        "forDevelopers": {
          "title": "สำหรับนักพัฒนา (API):",
          "description": "คำขอ JavaScript/AJAX จะได้รับการตอบกลับ JSON แทนการเปลี่ยนเส้นทางหน้า เหมาะสำหรับฟอร์มไดนามิกที่ไม่โหลดหน้าใหม่"
        },
        "overrideOptions": {
          "title": "ขั้นสูง: ตัวเลือกแทนที่",
          "description": "คุณสามารถเพิ่มพารามิเตอร์พิเศษใน URL ฟอร์มของคุณเพื่อควบคุมสิ่งที่เกิดขึ้น:",
          "redirectHtml": "• **?redirect=html** - แสดงหน้าสำเร็จในตัวเสมอ",
          "redirectNone": "• **?redirect=none** - สำหรับนักพัฒนา: ส่งคืน JSON แทนการเปลี่ยนเส้นทาง"
        }
      },
      "integrationExamples": {
        "title": "ตัวอย่างการผสานรวม",
        "description": "นี่คือตัวอย่างว่าวิธีการผสานรวมที่แตกต่างกันจัดการการส่งฟอร์มอย่างไร:",
        "javascript": {
          "title": "JavaScript (AJAX):",
          "code": "fetch('/v1/digest/form-id', {\n  method: 'POST',\n  headers: {\n    'Content-Type': 'application/json'\n  },\n  body: JSON.stringify({\n    email: 'user@example.com',\n    message: 'Hello!'\n  })\n})",
          "success": "✅ สำเร็จ: ได้รับการตอบกลับ JSON",
          "error": "❌ ข้อผิดพลาด: ได้รับ JSON ข้อผิดพลาดที่ละเอียดสำหรับการจัดการแบบกำหนดเอง"
        },
        "htmlForm": {
          "title": "ฟอร์ม HTML:",
          "code": "<form action=\"/v1/digest/form-id\" \n      method=\"POST\">\n  <input name=\"email\" type=\"email\">\n  <input name=\"message\">\n  <button type=\"submit\">Send</button>\n</form>",
          "success": "✅ สำเร็จ: เปลี่ยนเส้นทางไปยังหน้าขอบคุณหรือ URL แบบกำหนดเอง",
          "error": "❌ ข้อผิดพลาด: แสดงหน้าข้อผิดพลาดที่เป็นมิตรกับผู้ใช้พร้อมฟอร์ม"
        }
      },
      "proTips": {
        "title": "เคล็ดลับโปรสำหรับประสบการณ์ผู้ใช้ที่ดีขึ้น",
        "setRedirect": "• **ตั้งค่า redirect URL** เพื่อส่งผู้เยี่ยมชมไปยังหน้าขอบคุณแบบกำหนดเองพร้อมขั้นตอนถัดไป",
        "testForms": "• **ทดสอบฟอร์มของคุณ** โดยกรอกข้อมูลผิด ๆ เพื่อดูประสบการณ์ข้อผิดพลาด",
        "helpfulErrors": "• **ทำให้ข้อความแสดงข้อผิดพลาดเป็นประโยชน์** - ผู้ใช้ชื่นชมคำแนะนำที่ชัดเจนเกี่ยวกับวิธีแก้ไขปัญหา",
        "monitor": "• **ตรวจสอบการส่งข้อมูล** ในแท็บ Messages เพื่อเห็นรูปแบบหรือปัญหาทั่วไปของผู้ใช้"
      }
    },
    "integrationMethods": {
      "title": "วิธีการผสานรวม",
      "subtitle": "วิธีต่าง ๆ ในการเพิ่มฟอร์มลงในเว็บไซต์ของคุณ",
      "description": "Formshive มีหลายวิธีในการผสานรวมฟอร์มลงในเว็บไซต์ของคุณ ตั้งแต่โซลูชันคัดลอกและวาง ไปจนถึงการปรับแต่งขั้นสูง",
      "manual": {
        "title": "HTML แบบแมนนวล",
        "tags": {
          "existingForms": "ฟอร์มที่มีอยู่",
          "veryFlexible": "ยืดหยุ่นมาก",
          "customDesign": "การออกแบบแบบกำหนดเอง"
        },
        "description": "เขียนฟอร์ม HTML ของคุณเองและชี้ไปที่ Formshive เหมาะถ้าคุณคุ้นเคยกับ HTML หรือมีฟอร์มที่มีอยู่แล้ว",
        "code": "<form action=\"your-form-url\" method=\"POST\">\n  <input name=\"email\" type=\"email\">\n  <button type=\"submit\">Send</button>\n</form>",
        "success": "**✅ สำเร็จ:** ปฏิบัติตามพฤติกรรมการเปลี่ยนเส้นทางจาก \"Form Submission\" - การเปลี่ยนเส้นทาง URL แบบกำหนดเองหรือหน้าสำเร็จในตัว",
        "validation": "**⚠️ ข้อผิดพลาดการตรวจสอบ:** เฉพาะสำหรับฟอร์มที่มีฟิลด์ที่กำหนดไว้ (ดู \"ฟอร์มที่มีและไม่มีฟิลด์\") - แสดงหน้าข้อผิดพลาดที่เป็นมิตรกับผู้ใช้พร้อมข้อมูลที่เก็บไว้และข้อผิดพลาดฟิลด์ที่เน้น"
      },
      "javascript": {
        "title": "JavaScript Embed",
        "tags": {
          "bestUx": "UX ที่ดีที่สุด",
          "noPageReloads": "ไม่มีการโหลดหน้าใหม่",
          "dynamic": "ไดนามิก"
        },
        "description": "เพิ่มสคริปต์เล็ก ๆ ลงในเว็บไซต์ของคุณ และ Formshive จะสร้างฟอร์มโดยอัตโนมัติ ใช้งานได้ดีกับฟิลด์ที่กำหนดไว้",
        "code": "<div id=\"formshive\" form-id=\"your-id\">\n</div>\n<script src=\"formshive-embed.js\">\n</script>",
        "success": "**✅ สำเร็จ:** พร้อม redirect URL - เปลี่ยนเส้นทางหน้า ไม่มี redirect URL - แสดงข้อความสำเร็จในบรรทัดและล้างฟอร์ม",
        "validation": "**⚠️ ข้อผิดพลาดการตรวจสอบ:** สำหรับฟอร์มที่มีฟิลด์ที่กำหนดไว้ - เน้นข้อผิดพลาดฟิลด์เฉพาะโดยตรงในฟอร์มด้วยการจัดแต่งสีแดงและข้อความแสดงข้อผิดพลาด เป็นมิตรกับผู้ใช้มากกว่าการโหลดหน้าใหม่!"
      },
      "iframe": {
        "title": "IFrame",
        "tags": {
          "veryEasy": "ง่ายมาก",
          "worksEverywhere": "ใช้ได้ทุกที่",
          "copyPaste": "คัดลอกและวาง"
        },
        "description": "ฝังฟอร์มที่สมบูรณ์เป็นเฟรมในหน้าของคุณ ง่ายต่อการเพิ่ม ใช้ได้ทุกที่ พร้อมตัวเลือกการจัดแต่งที่แตกต่างกัน",
        "code": "<iframe \n  src=\"your-form-url\"\n  width=\"100%\" height=\"350\">\n</iframe>",
        "success": "**✅ สำเร็จ:** แสดงหน้าสำเร็จในตัวภายใน iframe ผู้ใช้อยู่บนเว็บไซต์ของคุณ",
        "validation": "**⚠️ ข้อผิดพลาดการตรวจสอบ:** สำหรับฟอร์มที่มีฟิลด์ที่กำหนดไว้ - แสดงหน้าข้อผิดพลาดภายใน iframe พร้อมข้อมูลที่เก็บไว้และการเน้นฟิลด์ ผู้ใช้อยู่บนไซต์ของคุณขณะแก้ไขข้อผิดพลาด"
      },
      "directLink": {
        "title": "ลิงก์โดยตรง",
        "tags": {
          "veryEasy": "ง่ายมาก",
          "socialMedia": "โซเชียลมีเดีย",
          "standalone": "แบบสแตนด์อโลน"
        },
        "description": "แชร์ลิงก์โดยตรงไปยังฟอร์มของคุณ เหมาะสำหรับอีเมล โซเชียลมีเดีย หรือเมื่อคุณต้องการหน้าฟอร์มแบบสแตนด์อโลน",
        "code": "https://formshive.com/link.html\n?form_id=your-form-id\n&title=Contact%20Us",
        "success": "**✅ สำเร็จ:** ประสบการณ์แบบเต็มหน้า - ปฏิบัติตามการตั้งค่าการเปลี่ยนเส้นทางของฟอร์มจาก \"Form Submission\" (URL แบบกำหนดเองหรือหน้าสำเร็จ)",
        "validation": "**⚠️ ข้อผิดพลาดการตรวจสอบ:** สำหรับฟอร์มที่มีฟิลด์ที่กำหนดไว้ - แสดงประสบการณ์ข้อผิดพลาดแบบเต็มหน้าพร้อมข้อมูลที่เก็บไว้และการเน้นฟิลด์ ผู้ใช้สามารถแก้ไขและส่งใหม่ได้ง่าย"
      },
      "whichMethod": {
        "title": "ฉันควรเลือกวิธีไหน?",
        "beginners": "**ผู้เริ่มต้น:** เริ่มต้นด้วย IFrame หรือ Direct Link - ง่ายที่สุด!",
        "existingForms": "**ฟอร์มที่มีอยู่:** ใช้ Manual HTML เพื่อรักษาการออกแบบปัจจุบันของคุณ",
        "advancedUsers": "**ผู้ใช้ขั้นสูง:** JavaScript Embed ให้ความยืดหยุ่นมากที่สุด"
      }
    },
    "emailSetup": {
      "title": "ผู้รับอีเมล",
      "subtitle": "รับการแจ้งเตือนเมื่อมีคนส่งฟอร์มของคุณ",
      "description": "เมื่อมีคนกรอกฟอร์มของคุณ, Formshive สามารถส่งการแจ้งเตือนทางอีเมลให้คุณได้ คุณสามารถเพิ่มที่อยู่อีเมลหลายแห่งเพื่อรับการแจ้งเตือนเหล่านี้",
      "verification": {
        "title": "ต้องมีการยืนยันอีเมล",
        "description": "เพื่อความปลอดภัย คุณจะต้องยืนยันที่อยู่อีเมลของคุณก่อนที่จะสามารถรับการส่งฟอร์มได้ นี่ป้องกันสแปมและให้แน่ใจว่าคุณเป็นเจ้าของที่อยู่อีเมลจริง ๆ"
      },
      "howItWorks": {
        "title": "วิธีการทำงาน:",
        "addEmail": "1. **เพิ่มอีเมลของคุณ:** ใส่ที่อยู่อีเมลที่คุณต้องการรับการแจ้งเตือน",
        "checkInbox": "2. **ตรวจสอบกล่องจดหมาย:** มองหาอีเมลยืนยันจาก Formshive",
        "clickVerify": "3. **คลิกเพื่อยืนยัน:** คลิกลิงก์ยืนยันในอีเมล",
        "ready": "4. **คุณพร้อมแล้ว!** เริ่มรับการส่งฟอร์มทันที"
      },
      "multipleRecipients": {
        "title": "ผู้รับหลายคน",
        "description": "คุณสามารถเพิ่มที่อยู่อีเมลที่ยืนยันแล้วหลายแห่งให้กับฟอร์มเดียว นี่เหมาะสำหรับทีมที่หลายคนต้องดูการส่งฟอร์ม"
      }
    },
    "captchaSetup": {
      "title": "การตั้งค่า CAPTCHA",
      "subtitle": "ป้องกันฟอร์มของคุณจากสแปมและบอท",
      "description": "CAPTCHA เป็นเหมือนยามรักษาความปลอดภัยสำหรับฟอร์มของคุณ มันช่วยบล็อกข้อความสแปมและให้แน่ใจว่าคนจริงกำลังกรอกฟอร์มของคุณ ไม่ใช่บอทอัตโนมัติ",
      "howItWorks": {
        "title": "CAPTCHA ทำงานอย่างไร",
        "description": "เมื่อมีคนพยายามส่งฟอร์มของคุณ พวกเขาจะต้องแก้โจทย์คณิตศาสตร์ง่าย ๆ นี่ใช้เวลาเพียงไม่กี่วินาทีสำหรับมนุษย์ แต่หยุดบอทสแปมส่วนใหญ่ได้สมบูรณ์"
      },
      "setup": {
        "title": "การตั้งค่า CAPTCHA (3 ขั้นตอนง่าย ๆ):",
        "enable": "1. **เปิดใช้งาน CAPTCHA:** ไปที่การตั้งค่าฟอร์มของคุณและเปิด \"Check Challenge\"",
        "updateWebsite": "2. **อัปเดตเว็บไซต์ของคุณ:** เว็บไซต์ของคุณต้องการสคริปต์เล็ก ๆ เพื่อแสดง CAPTCHA",
        "test": "3. **ทดสอบ:** ลองส่งฟอร์มของคุณเพื่อให้แน่ใจว่าใช้งานได้"
      },
      "benefits": {
        "title": "ประโยชน์ของการใช้ CAPTCHA:",
        "left": {
          "blocksSpam": "✅ **บล็อกสแปม:** ลดข้อความที่ไม่ต้องการได้อย่างมาก",
          "noTracking": "✅ **ไม่มีการติดตาม:** เป็นมิตรกับความเป็นส่วนตัวและสอดคล้องกับ GDPR",
          "free": "✅ **ใช้ฟรี:** ไม่มีค่าใช้จ่ายเพิ่มเติมสำหรับสแปมที่ถูกบล็อก"
        },
        "right": {
          "quickForUsers": "⚡ **เร็วสำหรับผู้ใช้:** ใช้เวลาแค่ 2-3 วินาทีในการทำให้เสร็จ",
          "worksEverywhere": "⚡ **ใช้ได้ทุกที่:** เข้ากันได้กับวิธีการผสานรวมทั้งหมด",
          "alwaysImproving": "⚡ **ปรับปรุงอยู่เสมอ:** อัปเดตโดยอัตโนมัติเพื่อการป้องกันที่ดีขึ้น"
        }
      },
      "technicalHelp": {
        "title": "ต้องการความช่วยเหลือด้านเทคนิค?",
        "description": "สำหรับคำแนะนำการตั้งค่าที่ละเอียดและตัวอย่างโค้ด ตรวจสอบแท็บ **Integration** เมื่อแก้ไขฟอร์มของคุณ มันมีรายละเอียดทางเทคนิคทั้งหมดและโค้ดคัดลอกและวางที่คุณต้องการ"
      }
    },
    "fieldConfiguration": {
      "title": "การกำหนดค่าฟิลด์",
      "subtitle": "การปรับแต่งฟิลด์ฟอร์มของคุณ",
      "description": "เมื่อคุณสร้างฟอร์มที่มีฟิลด์ที่กำหนดไว้ คุณสามารถปรับแต่งฟิลด์แต่ละอันให้ทำงานตามที่คุณต้องการได้",
      "fieldTypes": {
        "title": "ประเภทฟิลด์ที่มี:",
        "text": "• **Text:** การป้อนข้อความบรรทัดเดียว",
        "email": "• **Email:** อีเมลพร้อมการตรวจสอบอัตโนมัติ",
        "textarea": "• **Textarea:** ข้อความหลายบรรทัดสำหรับข้อความยาว",
        "number": "• **Number:** รับเฉพาะตัวเลข",
        "phone": "• **Phone:** การป้อนหมายเลขโทรศัพท์",
        "url": "• **URL:** ลิงก์เว็บไซต์พร้อมการตรวจสอบ",
        "date": "• **Date:** ตัวเลือกวันที่",
        "file": "• **File:** การอัปโหลดไฟล์",
        "select": "• **Select:** เมนูดรอปดาวน์",
        "radio": "• **Radio:** เลือกตัวเลือกเดียว",
        "checkbox": "• **Checkbox:** การเลือกหลายตัวเลือก"
      },
      "validationOptions": {
        "title": "ตัวเลือกการตรวจสอบ:",
        "required": "• **ฟิลด์บังคับ:** ต้องกรอกให้สมบูรณ์",
        "emailValidation": "• **การตรวจสอบอีเมล:** ตรวจสอบรูปแบบอีเมลที่ถูกต้อง",
        "urlValidation": "• **การตรวจสอบ URL:** ให้แน่ใจว่าเป็นลิงก์เว็บที่เหมาะสม",
        "customOptions": "• **ตัวเลือกแบบกำหนดเอง:** สำหรับดรอปดาวน์และการเลือก",
        "helpText": "• **ข้อความช่วยเหลือ:** คำแนะนำสำหรับผู้ใช้",
        "placeholders": "• **Placeholders:** ข้อความตัวอย่างในฟิลด์"
      },
      "proTip": {
        "title": "เคล็ดลับโปร",
        "description": "เริ่มต้นง่าย ๆ ด้วยฟิลด์เพียงไม่กี่อัน เช่น ชื่อ อีเมล และข้อความ คุณสามารถเพิ่มฟิลด์เพิ่มเติมได้ในภายหลังเมื่อความต้องการของคุณเติบโต!"
      }
    },
    "tomlConfiguration": {
      "title": "การกำหนดค่าฟิลด์แบบโปรแกรม (TOML)",
      "subtitle": "การกำหนดค่าฟอร์มขั้นสูงโดยใช้โค้ด",
      "advancedOnly": {
        "title": "สำหรับผู้ใช้ขั้นสูงเท่านั้น",
        "description": "ส่วนนี้สำหรับนักพัฒนาและผู้ใช้ขั้นสูงที่ต้องการกำหนดค่าฟอร์มโดยใช้โค้ด หากคุณพอใจกับเครื่องมือสร้างฟอร์มแบบภาพ คุณสามารถข้ามส่วนนี้ได้เลย"
      },
      "description": "แทนที่จะใช้เครื่องมือสร้างฟอร์มแบบภาพ คุณสามารถกำหนดฟิลด์ฟอร์มของคุณโดยใช้การกำหนดค่า TOML นี่ให้คุณการควบคุมที่แม่นยำมากขึ้นและทำให้ง่ายต่อการควบคุมเวอร์ชันของข้อกำหนดฟอร์มของคุณ TOML (Tom's Obvious, Minimal Language) เป็นรูปแบบการกำหนดค่าง่าย ๆ ที่ให้คุณกำหนดฟิลด์ฟอร์ม กฎการตรวจสอบ และพฤติกรรมโดยใช้ข้อความที่มีโครงสร้างแทนการคลิกผ่านเมนู",
      "basicExample": {
        "title": "ตัวอย่างพื้นฐาน:",
        "code": "[field]\nname = \"email\"\nfield = \"email\"\nlabel = \"Your Email\"\nplaceholder = \"Enter your email address\"\nrequired = true\nis_email = true\n\n[field]\nname = \"message\"\nfield = \"textarea\"\nlabel = \"Message\"\nplaceholder = \"Tell us what you think\"\nrequired = true\nis_min = 10"
      },
      "fieldTypesAvailable": {
        "title": "ประเภทฟิลด์ที่มี:",
        "text": "• **text:** การป้อนข้อความบรรทัดเดียว",
        "email": "• **email:** อีเมลพร้อมการตรวจสอบ",
        "textarea": "• **textarea:** พื้นที่ข้อความหลายบรรทัด",
        "select": "• **select:** เมนูดรอปดาวน์",
        "checkbox": "• **checkbox:** ตัวเลือกหลายทางเลือก",
        "number": "• **number:** การป้อนตัวเลข"
      },
      "validationOptions": {
        "title": "ตัวเลือกการตรวจสอบ:",
        "required": "• **required:** ฟิลด์ต้องกรอก",
        "isEmail": "• **is_email:** ตรวจสอบรูปแบบอีเมล",
        "isMin": "• **is_min:** ความยาว/ค่าต่ำสุด",
        "isMax": "• **is_max:** ความยาว/ค่าสูงสุด",
        "options": "• **options:** ตัวเลือกที่ถูกต้องสำหรับ select/checkbox",
        "checkSpam": "• **check_spam:** เปิดใช้งานการตรวจจับสแปม"
      },
      "benefits": {
        "title": "ประโยชน์ของการกำหนดค่า TOML:",
        "versionControl": "✨ **Version Control:** ติดตามการเปลี่ยนแปลงฟอร์มของคุณตลอดเวลา",
        "reusable": "✨ **นำกลับมาใช้ได้:** คัดลอกการกำหนดค่าระหว่างฟอร์มได้ง่าย",
        "preciseControl": "✨ **การควบคุมที่แม่นยำ:** ปรับแต่งการตรวจสอบและพฤติกรรมอย่างละเอียด",
        "teamCollaboration": "✨ **การทำงานร่วมกันของทีม:** แชร์ข้อกำหนดฟอร์มโดยไม่ต้องเข้าถึงบัญชี",
        "advancedFeatures": "✨ **คุณสมบัติขั้นสูง:** เข้าถึงตัวเลือกการตรวจสอบทั้งหมด"
      },
      "gettingStarted": {
        "title": "การเริ่มต้น",
        "description": "หากต้องการใช้การกำหนดค่า TOML ไปที่ส่วน **Form Fields (Optional)** ของฟอร์มของคุณและวางข้อกำหนด TOML ของคุณลงในพื้นที่ข้อความ ระบบจะตรวจสอบการกำหนดค่าของคุณและแสดงข้อผิดพลาดที่ต้องแก้ไข"
      }
    }
  }
}